jelson/rulos/src/lib/chip/arm/stm32/periph/twi/twi.c
/*
 * Copyright (C) 2009 Jon Howell (jonh@jonh.net) and Jeremy Elson
 * (jelson@gmail.com).
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <https://www.gnu.org/licenses/>.
 */

/*
 * STM32 TWI support
 */

#include <string.h>

#include "core/dma.h"
#include "core/hardware.h"
#include "core/hardware_types.h"
#include "core/rulos.h"

#if defined(RULOS_ARM_stm32f0)
#define RULOS_I2C_V2
#include "stm32f0xx_ll_i2c.h"
#include "stm32f0xx_ll_rcc.h"

#elif defined(RULOS_ARM_stm32f1)
#define RULOS_I2C_V1
#include "stm32f1xx_ll_i2c.h"
#include "stm32f1xx_ll_rcc.h"

#define rI2C1_CLK_ENABLE() __HAL_RCC_I2C1_CLK_ENABLE()
#define rI2C1_SDA_GPIO_CLK_ENABLE() __HAL_RCC_GPIOB_CLK_ENABLE()
#define rI2C1_SCL_GPIO_CLK_ENABLE() __HAL_RCC_GPIOB_CLK_ENABLE()
#define rI2C1_FORCE_RESET() __HAL_RCC_I2C1_FORCE_RESET()
#define rI2C1_RELEASE_RESET() __HAL_RCC_I2C1_RELEASE_RESET()
#define rI2C1_SCL_PIN GPIO_PIN_6
#define rI2C1_SCL_GPIO_PORT GPIOB
#define rI2C1_SDA_PIN GPIO_PIN_7
#define rI2C1_SDA_GPIO_PORT GPIOB

#elif defined(RULOS_ARM_stm32f3)
#define RULOS_I2C_V2
#include "stm32f3xx_ll_bus.h"
#include "stm32f3xx_ll_i2c.h"
#include "stm32f3xx_ll_rcc.h"

#define rI2C1_CLK_ENABLE() __HAL_RCC_I2C1_CLK_ENABLE()
#define rI2C1_SDA_GPIO_CLK_ENABLE() __HAL_RCC_GPIOB_CLK_ENABLE()
#define rI2C1_SCL_GPIO_CLK_ENABLE() __HAL_RCC_GPIOB_CLK_ENABLE()
#define rI2C1_FORCE_RESET() __HAL_RCC_I2C1_FORCE_RESET()
#define rI2C1_RELEASE_RESET() __HAL_RCC_I2C1_RELEASE_RESET()

#ifdef RULOS_I2C_ALT_MAPPING
#define rI2C1_SCL_PIN GPIO_PIN_8
#define rI2C1_SCL_GPIO_PORT GPIOB
#define rI2C1_SDA_PIN GPIO_PIN_9
#define rI2C1_SDA_GPIO_PORT GPIOB
#else
#define rI2C1_SCL_PIN GPIO_PIN_6
#define rI2C1_SCL_GPIO_PORT GPIOB
#define rI2C1_SDA_PIN GPIO_PIN_7
#define rI2C1_SDA_GPIO_PORT GPIOB
#endif
#define rI2C1_GPIO_ALTFUNC GPIO_AF4_I2C1

#elif defined(RULOS_ARM_stm32g0)
#define RULOS_I2C_V2
#include "stm32g0xx_ll_bus.h"
#include "stm32g0xx_ll_i2c.h"
#include "stm32g0xx_ll_rcc.h"

#define rI2C1_CLK_ENABLE() __HAL_RCC_I2C1_CLK_ENABLE()
#define rI2C1_SDA_GPIO_CLK_ENABLE() __HAL_RCC_GPIOB_CLK_ENABLE()
#define rI2C1_SCL_GPIO_CLK_ENABLE() __HAL_RCC_GPIOB_CLK_ENABLE()
#define rI2C1_FORCE_RESET() __HAL_RCC_I2C1_FORCE_RESET()
#define rI2C1_RELEASE_RESET() __HAL_RCC_I2C1_RELEASE_RESET()

#define rI2C1_SCL_PIN GPIO_PIN_6
#define rI2C1_SCL_GPIO_PORT GPIOB
#define rI2C1_SDA_PIN GPIO_PIN_7
#define rI2C1_SDA_GPIO_PORT GPIOB
#define rI2C1_GPIO_ALTFUNC GPIO_AF4_I2C1

#else
#error "Your chip's definitions for I2C registers could use some help."
#include <stophere>
#endif

/*
 * LL_I2C_DMA_GetRegAddr has a different signature on V1 vs V2: V1 has
 * one DR register for both send and receive, V2 has separate TXDR/RXDR
 * and wants a selector. Wrap the difference here so the call sites
 * don't need to care.
 */
#if defined(RULOS_I2C_V1)
#define rI2C1_DMA_TX_REG_ADDR() \
  ((volatile void *)(uintptr_t)LL_I2C_DMA_GetRegAddr(I2C1))
#define rI2C1_DMA_RX_REG_ADDR() \
  ((volatile void *)(uintptr_t)LL_I2C_DMA_GetRegAddr(I2C1))
#else
#define rI2C1_DMA_TX_REG_ADDR()                        \
  ((volatile void *)(uintptr_t)LL_I2C_DMA_GetRegAddr(  \
      I2C1, LL_I2C_DMA_REG_DATA_TRANSMIT))
#define rI2C1_DMA_RX_REG_ADDR()                        \
  ((volatile void *)(uintptr_t)LL_I2C_DMA_GetRegAddr(  \
      I2C1, LL_I2C_DMA_REG_DATA_RECEIVE))
#endif

typedef struct {
  MediaStateIfc media;
  I2C_TypeDef *handle;

  // DMA channels for TX/RX (allocated via rulos_dma in hal_twi_init).
  rulos_dma_channel_t *tx_dma_ch;
  rulos_dma_channel_t *rx_dma_ch;

  // sending
  MediaSendDoneFunc send_done_cb;
  void *send_done_cb_data;
  uint8_t send_addr;
  // send_data and send_len are stashed on the initial twi_send so
  // that V2 ARLO retries can re-arm the TX DMA from the same buffer
  // without needing the caller to re-submit.
  const void *send_data;
  uint8_t send_len;
  uint32_t packets_sent;
  uint32_t packets_nacked;
  uint32_t send_errors;
#ifdef RULOS_I2C_V2
  // When set, an earlier master-send attempt lost arbitration and is
  // waiting to be re-launched. send_done_cb stays non-null (so the
  // user can't queue another send) but the EV/ER dispatch gates off
  // retry_pending so the slave-receive path can service the winning
  // master's packet in the meantime.
  bool send_retry_pending;
  uint32_t send_arlo_retries;
#endif

  // receiving
  MediaRecvSlot *slaveRecvSlot;
} TwiState;

// Right now the RULOS HAL interface doesn't even support multiple
// TWIs; I'm trying to structure the code in such a way that it won't
// be a violent change once it does.
#define NUM_TWI 1
static TwiState g_twi[NUM_TWI];

/// util ////

static void reset_bus(TwiState *twi) {
#if defined(RULOS_I2C_V1)
  LL_I2C_EnableReset(I2C1);
  LL_I2C_DisableReset(I2C1);
#elif defined(RULOS_I2C_V2)
  LL_I2C_Disable(I2C1);
  LL_I2C_Enable(I2C1);
#else
#include <stophere>
#endif
}

/////////////////////// receiving /////////////////////////////////////////

// Warning: runs in interrupt context.
static void twi_recv_done(TwiState *twi) {
  // Real packet received!
  assert(twi->slaveRecvSlot != NULL);
  int packet_len = twi->slaveRecvSlot->capacity -
                   rulos_dma_get_remaining(twi->rx_dma_ch);

  if (packet_len > 0) {
    twi->slaveRecvSlot->packet_len = packet_len;
    twi->slaveRecvSlot->func(twi->slaveRecvSlot);
  }
}

// Warning: runs in interrupt context.
static void twi_recv_event_interrupt(TwiState *twi) {
  // TODO: make I2C1 a constant inside TwiState if we ever have a
  // second TWI interface
  if (LL_I2C_IsActiveFlag_ADDR(I2C1)) {
    // New packet has arrived. Set up a DMA transfer and ack the packet.
    rulos_dma_start(twi->rx_dma_ch, rI2C1_DMA_RX_REG_ADDR(),
                    &twi->slaveRecvSlot->data[0],
                    twi->slaveRecvSlot->capacity);
    LL_I2C_EnableDMAReq_RX(I2C1);
    LL_I2C_ClearFlag_ADDR(I2C1);
  } else if (LL_I2C_IsActiveFlag_STOP(I2C1)) {
    // Stop detected. Clear the stop flag and run the receive handler.
    LL_I2C_ClearFlag_STOP(I2C1);
    LL_I2C_DisableDMAReq_RX(I2C1);
    rulos_dma_stop(twi->rx_dma_ch);
    twi_recv_done(twi);
  }
}

