jelson/rulos/src/lib/chip/arm/stm32/periph/twi/twi.c
// Warning: runs in interrupt context.
static void twi_recv_error_interrupt(TwiState *twi) {
  LL_I2C_DisableDMAReq_RX(I2C1);
}

// DMA TC callback: the RX channel fires TC only if the receive buffer
// fills (the normal stop path uses the I2C EV IRQ + STOP detect, not
// DMA TC). Stop accepting data.
static void twi_rx_dma_tc_callback(void *user_data) {
  (void)user_data;
  LL_I2C_DisableDMAReq_RX(I2C1);
  LL_I2C_AcknowledgeNextData(I2C1, LL_I2C_NACK);
}

/////////////////////// sending /////////////////////////////////////////

#define MASTER_ACTIVE(twi) ((twi)->send_done_cb != NULL)

// Warning: runs in interrupt context.
static void twi_send_done_upcall(TwiState *twi) {
  assert(MASTER_ACTIVE(twi));

  // NB: send_done_cb must be nulled before the callback runs, since
  // the callback is likely to want to send another packet. But,
  // schedule_now doesn't run the callback until the scheduler runs
  // again, so this works.
  schedule_now((ActivationFuncPtr)twi->send_done_cb, twi->send_done_cb_data);
  twi->send_done_cb = NULL;
  twi->send_done_cb_data = NULL;
}

#if defined(RULOS_I2C_V1)
static void twi_generate_stop(TwiState *twi) {
  LL_I2C_GenerateStopCondition(I2C1);

  // The ST I2C application note AN2824 says you're supposed to wait
  // for STOP to be cleared by the hardware after setting it.
  // https://www.st.com/content/ccc/resource/technical/document/application_note/5d/ae/a3/6f/08/69/4e/9b/CD00209826.pdf/files/CD00209826.pdf/jcr:content/translations/en.CD00209826.pdf
  // I've noticed that sometimes, under heavy load, this waits
  // forever. I'm not sure why. So we time out.
  int timeout = 1000;
  while (timeout > 0 && READ_BIT(I2C1->CR1, I2C_CR1_STOP)) {
    timeout--;
  }
  if (timeout == 0) {
    reset_bus(twi);
  }

  twi_send_done_upcall(twi);
}

// Send event interrupts for I2C V1. Warning: runs in interrupt context.
static void twi_send_event_interrupt(TwiState *twi) {
  // TODO: make I2C1 a constant inside TwiState if we ever have a
  // second TWI interface
  if (LL_I2C_IsActiveFlag_SB(I2C1)) {
    // Start has been transmitted. Transmit the target address.
    LL_I2C_TransmitData8(I2C1, twi->send_addr);
  } else if (LL_I2C_IsActiveFlag_ADDR(I2C1)) {
    // Address has been acknowledged. Enable the DMA transfer for the
    // outgoing data.
    LL_I2C_EnableDMAReq_TX(I2C1);
    LL_I2C_ClearFlag_ADDR(I2C1);
  } else if (LL_I2C_IsActiveFlag_BTF(I2C1) || LL_I2C_IsActiveFlag_TXE(I2C1)) {
    // After DMA has been disabled, BTF or TXE indicates the hardware
    // is ready for the next outgoing byte. We can either respond with
    // data or a STOP to indicate there's no more. We send a stop.
    twi_generate_stop(twi);
  }
}

// Send error interrupts for I2C V1. Warning: runs in interrupt context.
static void twi_send_error_interrupt(TwiState *twi) {
  // Generate a stop in case of any error.
  twi_generate_stop(twi);
}

#elif defined(RULOS_I2C_V2)

// Send event interrupts for I2C V2. Warning: runs in interrupt context.
static void twi_send_event_interrupt(TwiState *twi) {
  // Transmit-complete: successful transmission.
  if (LL_I2C_IsActiveFlag_STOP(I2C1)) {
    LL_I2C_ClearFlag_STOP(I2C1);

    // Check to see if we got a NACK. Doesn't really do anything but
    // statistics collection.
    if (LL_I2C_IsActiveFlag_NACK(I2C1)) {
      LL_I2C_ClearFlag_NACK(I2C1);
      twi->packets_nacked++;
    } else {
      twi->packets_sent++;
    }
    twi_send_done_upcall(twi);
  }
}

// Warning: runs in interrupt context.
static void twi_send_error_interrupt(TwiState *twi) {
  // V2 uses autostop, so generate send-done upcall; no need to
  // generate a stop.
  twi->send_errors++;
  twi_send_done_upcall(twi);
}
#else
#include <stophere>
#endif

// DMA TC callback for the I2C TX channel. Disables the peripheral's
// DMA request so that a BTF event is generated (V1) or the autostop
// sequence completes (V2).
static void twi_tx_dma_tc_callback(void *user_data) {
  (void)user_data;
  LL_I2C_DisableDMAReq_TX(I2C1);
}

// Arm the TX DMA channel and kick off a master write using whatever
// is currently stashed in twi->send_data / send_len / send_addr. Used
// both for fresh sends (from twi_send) and for ARLO retries (from the
// slave-receive STOP handler and the twi_arlo_retry_poll activation).
//
// Caller is responsible for bus state: on fresh sends, twi_send waits
// for BUSY to clear before calling this; on retries, the caller has
// either just observed STOP on a slave-receive or confirmed BUSY is
// clear via poll. Even if the bus goes busy between the check and
// here, HandleTransfer's START-bit pattern on V2 (and the equivalent
// on V1) causes the hardware to wait for bus idle before actually
// issuing START, so we either win the next arbitration or ARLO and
// retry again.
static void twi_launch_send(TwiState *twi) {
  rulos_dma_start(twi->tx_dma_ch, rI2C1_DMA_TX_REG_ADDR(),
                  (void *)twi->send_data, twi->send_len);
#ifdef RULOS_I2C_V2
  // V2 enables DMA immediately because it auto-transmits the
  // address. V1 only enables DMA once address has been transmitted.
  LL_I2C_EnableDMAReq_TX(I2C1);
#endif

#ifdef RULOS_I2C_V1
  LL_I2C_DisableBitPOS(I2C1);
#endif

  LL_I2C_AcknowledgeNextData(I2C1, LL_I2C_ACK);

#if defined(RULOS_I2C_V1)
  LL_I2C_GenerateStartCondition(I2C1);
#elif defined(RULOS_I2C_V2)
  LL_I2C_HandleTransfer(I2C1, twi->send_addr, LL_I2C_ADDRSLAVE_7BIT,
                        twi->send_len, LL_I2C_MODE_AUTOEND,
                        LL_I2C_GENERATE_START_WRITE);
#else
#include <stophere>
#endif
}

#ifdef RULOS_I2C_V2
// Scheduled polling activation for the "pure ARLO" retry path: we
// lost arbitration but weren't addressed ourselves, so no EV IRQ
// (ADDR/STOP) will ever arrive to tell us the bus is idle again.
// Poll BUSY periodically and re-launch when clear. The ADDR+ARLO
// path also schedules this as a belt-and-suspenders fallback in
// case the slave-receive STOP path doesn't fire for some reason;
// whichever side wins the race just clears send_retry_pending and
// the other one no-ops.
static void twi_arlo_retry_poll(void *data) {
  TwiState *twi = (TwiState *)data;

  rulos_irq_state_t old_interrupts = hal_start_atomic();
  if (!twi->send_retry_pending) {
    // The EV STOP path (or a previous poll tick) already re-launched
    // the send -- nothing to do.
    hal_end_atomic(old_interrupts);
    return;
  }
  if (LL_I2C_IsActiveFlag_BUSY(I2C1)) {
    // Bus is still in use -- most likely by the master that just beat
    // us. Come back in a millisecond.
    hal_end_atomic(old_interrupts);
    schedule_us(1000, twi_arlo_retry_poll, twi);
    return;
  }

  twi->send_retry_pending = false;
  twi_launch_send(twi);
  hal_end_atomic(old_interrupts);
}
#endif

static void twi_send(MediaStateIfc *media, Addr dest_addr, const void *data,
                     uint8_t len, MediaSendDoneFunc send_done_cb,
                     void *send_done_cb_data) {
#ifdef TIMING_DEBUG_PIN
  gpio_set(TIMING_DEBUG_PIN);
#endif

  // If we ever support multiple TWI interfaces, add a lookup based on
  // id here.
  TwiState *twi = &g_twi[0];

  // !MASTER_ACTIVE also covers !send_retry_pending: send_retry_pending
  // is only ever set when send_done_cb is non-null, and is cleared by
  // the retry launch path before send_done_cb itself is nulled.
  assert(!MASTER_ACTIVE(twi));

