jelson/rulos/src/lib/chip/arm/stm32/periph/twi/twi.c
#if 0
  // Hardware bug fix? Sometimes stop isn't cleared.
  CLEAR_BIT(I2C1->CR1, I2C_CR1_STOP);
#endif

  // Wait for the current transaction to be complete, if any. Then,
  // atomically enable master mode. Bound the wait so a wedged BUSY
  // flag (e.g. a stuck SCL/SDA) can't hang the CPU indefinitely here;
  // 100 ms is well above any legitimate multimaster collision or
  // slave-receive window, so hitting it means the peripheral needs a
  // reset. reset_bus just toggles PE, which preserves CR1 and the
  // DMA channel config, so the launch below will proceed cleanly on
  // the recovered peripheral.
  const Time busy_deadline = precise_clock_time_us() + 100000;
  rulos_irq_state_t old_interrupts = hal_start_atomic();
  while (LL_I2C_IsActiveFlag_BUSY(I2C1)) {
    hal_end_atomic(old_interrupts);
    __WFI();
    old_interrupts = hal_start_atomic();
    if ((int32_t)(precise_clock_time_us() - busy_deadline) >= 0) {
      reset_bus(twi);
      break;
    }
  }

  twi->send_done_cb = send_done_cb;
  twi->send_done_cb_data = send_done_cb_data;
  twi->send_addr = dest_addr << 1;  // add "write" bit
  twi->send_data = data;
  twi->send_len = len;
  twi_launch_send(twi);
  hal_end_atomic(old_interrupts);

#ifdef TIMING_DEBUG_PIN
  gpio_clr(TIMING_DEBUG_PIN);
#endif
}

//////////////////////////////////////////////////////////////////////////

MediaStateIfc *hal_twi_init(uint32_t speed_khz, Addr local_addr,
                            MediaRecvSlot *const slaveRecvSlot) {
  // Someday, if we make the HAL interface support multiple TWI
  // interfaces, this line should be changed from [0] to [index].
  TwiState *twi = &g_twi[0];
  memset(twi, 0, sizeof(TwiState));
  twi->handle = I2C1;
  twi->media.send = &twi_send;
  twi->slaveRecvSlot = slaveRecvSlot;

  // Enable clocks (DMA clock is already enabled by core/stm32-hardware.c).
  rI2C1_SCL_GPIO_CLK_ENABLE();
  rI2C1_SDA_GPIO_CLK_ENABLE();
  rI2C1_CLK_ENABLE();

  reset_bus(twi);

  // Configure GPIO
  GPIO_InitTypeDef GPIO_InitStruct;
  GPIO_InitStruct.Pin = rI2C1_SCL_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
#ifdef rI2C1_GPIO_ALTFUNC
  GPIO_InitStruct.Alternate = rI2C1_GPIO_ALTFUNC;
#endif
  HAL_GPIO_Init(rI2C1_SCL_GPIO_PORT, &GPIO_InitStruct);

  GPIO_InitStruct.Pin = rI2C1_SDA_PIN;
  HAL_GPIO_Init(rI2C1_SDA_GPIO_PORT, &GPIO_InitStruct);

  // Allocate DMA TX channel
  rulos_dma_config_t tx_cfg = {
      .request = RULOS_DMA_REQ_I2C1_TX,
      .direction = RULOS_DMA_DIR_MEM_TO_PERIPH,
      .mode = RULOS_DMA_MODE_NORMAL,
      .periph_width = RULOS_DMA_WIDTH_BYTE,
      .mem_width = RULOS_DMA_WIDTH_BYTE,
      .periph_increment = false,
      .mem_increment = true,
      .priority = RULOS_DMA_PRIORITY_LOW,
      .tc_callback = twi_tx_dma_tc_callback,
      .user_data = twi,
  };
  twi->tx_dma_ch = rulos_dma_alloc(&tx_cfg);
  assert(twi->tx_dma_ch != NULL);

  // Allocate DMA RX channel
  rulos_dma_config_t rx_cfg = {
      .request = RULOS_DMA_REQ_I2C1_RX,
      .direction = RULOS_DMA_DIR_PERIPH_TO_MEM,
      .mode = RULOS_DMA_MODE_NORMAL,
      .periph_width = RULOS_DMA_WIDTH_BYTE,
      .mem_width = RULOS_DMA_WIDTH_BYTE,
      .periph_increment = false,
      .mem_increment = true,
      .priority = RULOS_DMA_PRIORITY_HIGH,
      .tc_callback = twi_rx_dma_tc_callback,
      .user_data = twi,
  };
  twi->rx_dma_ch = rulos_dma_alloc(&rx_cfg);
  assert(twi->rx_dma_ch != NULL);

  // Set up I2C
  LL_I2C_Disable(I2C1);
#if defined(RULOS_I2C_V1)
  LL_RCC_ClocksTypeDef rcc_clocks;
  LL_RCC_GetSystemClocksFreq(&rcc_clocks);
  LL_I2C_ConfigSpeed(I2C1, rcc_clocks.PCLK1_Frequency, speed_khz * 1000,
                     LL_I2C_DUTYCYCLE_2);
#elif defined(RULOS_I2C_V2)
  LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_I2C1);
  LL_RCC_SetI2CClockSource(LL_RCC_I2C1_CLKSOURCE_SYSCLK);
  // I can't figure out from the datasheet how to adjust these numbers
  // from first principles to make them correct. I'm kinda unhappy
  // with the STM32 I2C V2 peripheral's timing setup; the datasheet is
  // extremely hard to understand and there are no helper functions in
  // the code. They say "just ask our configuration tool", which you
  // can't translate to runtime code. The constants below are manually
  // adjusted for 100khz, 200khz and 400khz when the CPU is at 64
  // Mhz. Sorry.
  uint32_t timingr;
  if (speed_khz == 400) {
    timingr = __LL_I2C_CONVERT_TIMINGS(0,   // Prescaler
                                       13,  // SCLDEL, data setup time
                                       13,  // SDADEL, data hold time
                                       44,  // SCLH, clock high period
                                       74   // SCLL, clock low period
    );
  } else if (speed_khz == 200) {
    timingr = __LL_I2C_CONVERT_TIMINGS(1,   // Prescaler
                                       13,  // SCLDEL, data setup time
                                       13,  // SDADEL, data hold time
                                       54,  // SCLH, clock high period
                                       84   // SCLL, clock low period
    );
  } else if (speed_khz == 100) {
    timingr = __LL_I2C_CONVERT_TIMINGS(1,    // Prescaler
                                       13,   // SCLDEL, data setup time
                                       13,   // SDADEL, data hold time
                                       117,  // SCLH, clock high period
                                       181   // SCLL, clock low period
    );
  } else {
    __builtin_trap();
  }
  LL_I2C_SetTiming(I2C1, timingr);
#else
#include <stophere>
#error "timing for i2c needed"
#endif

  LL_I2C_SetOwnAddress1(I2C1, local_addr << 1, LL_I2C_OWNADDRESS1_7BIT);
#ifdef RULOS_I2C_V2
  LL_I2C_EnableOwnAddress1(I2C1);
#endif
  LL_I2C_EnableClockStretching(I2C1);
  LL_I2C_SetMode(I2C1, LL_I2C_MODE_I2C);

  // Turn on interrupts
  NVIC_SetPriority(I2C1_ER_IRQn, 0x2);
  NVIC_EnableIRQ(I2C1_ER_IRQn);
  NVIC_SetPriority(I2C1_EV_IRQn, 0x2);
  NVIC_EnableIRQ(I2C1_EV_IRQn);

#if defined(RULOS_I2C_V1)
  LL_I2C_EnableIT_EVT(I2C1);
#elif defined(RULOS_I2C_V2)
  LL_I2C_EnableIT_STOP(I2C1);
  LL_I2C_EnableIT_ADDR(I2C1);
#else
#include <stophere>
#endif
  LL_I2C_EnableIT_ERR(I2C1);

  // Enable!
  LL_I2C_Enable(I2C1);

