jelson/rulos/src/lib/chip/arm/stm32/periph/twi/twi.c
  // Turn on acks for incoming receives
  LL_I2C_AcknowledgeNextData(I2C1, LL_I2C_ACK);

#ifdef TIMING_DEBUG_PIN
  gpio_make_output(TIMING_DEBUG_PIN);
#endif

  return &twi->media;
}

//// interrupt handler trampolines

void I2C1_EV_IRQHandler(void) {
  TwiState *twi = &g_twi[0];

#if defined(RULOS_I2C_V2)
  // Multimaster race handling: on V2, ADDR can fire while MASTER_ACTIVE
  // is still true if we just lost arbitration to a master that happens
  // to be addressing us as slave. The ER IRQ for the accompanying ARLO
  // would normally null send_done_cb and let the dispatch below route
  // ADDR to the slave-receive path, but EV and ER are both configured
  // at NVIC priority 0x2, and EV has the lower IRQ number (31 vs 32 on
  // F303), so ER cannot preempt us here. If we return without touching
  // ADDR, NVIC tail-chains back into this handler immediately and we
  // live-lock while ER is starved. Mark the send as retry-pending and
  // fall through to the slave-receive path; the retry will be kicked
  // once the winning master's transaction completes.
  if (LL_I2C_IsActiveFlag_ADDR(I2C1) && MASTER_ACTIVE(twi) &&
      !twi->send_retry_pending) {
    // Clear ARLO ourselves if it's set; otherwise, when ER does finally
    // run (after we clear ADDR), it would find no error flags set and
    // would misdispatch to twi_recv_error_interrupt, which disables the
    // RX DMA we're about to enable. (The ER handler is also tightened
    // below to skip dispatch when no flag was actually handled, as a
    // belt-and-suspenders.)
    if (LL_I2C_IsActiveFlag_ARLO(I2C1)) {
      LL_I2C_ClearFlag_ARLO(I2C1);
    }
    twi->send_retry_pending = true;
    twi->send_arlo_retries++;
    // Primary retry kick: after the slave-receive below completes with
    // STOP, the tail of this handler re-launches the send. The poll
    // activation is a belt-and-suspenders fallback in case that STOP
    // path doesn't fire.
    schedule_us(1000, twi_arlo_retry_poll, twi);
    // send_done_cb is intentionally NOT nulled: we want the retry to
    // be transparent to the caller. The dispatch below gates the
    // master-send path on !send_retry_pending so the slave-receive
    // path gets to run.
  }
#endif

  if (MASTER_ACTIVE(twi)
#ifdef RULOS_I2C_V2
      && !twi->send_retry_pending
#endif
  ) {
    twi_send_event_interrupt(twi);
  } else {
    twi_recv_event_interrupt(twi);
  }

#ifdef RULOS_I2C_V2
  // If we're holding a retry from an ARLO'd send and the slave-receive
  // path above just drained the bus (STOP detected, BUSY cleared),
  // re-launch immediately. This covers the common ADDR+ARLO case
  // without waiting for twi_arlo_retry_poll to fire.
  if (twi->send_retry_pending && !LL_I2C_IsActiveFlag_BUSY(I2C1)) {
    twi->send_retry_pending = false;
    twi_launch_send(twi);
  }
#endif
}

void I2C1_ER_IRQHandler(void) {
  TwiState *twi = &g_twi[0];

  // In the future, if the send-done callback wants to differentiate
  // between different kinds of error, it can be recorded here and
  // passed into twi_send_done.
  bool handled_any = false;
  if (LL_I2C_IsActiveFlag_BERR(I2C1)) {
    // Bus error. Reset the I2C interface in hopes of recovering.
    LL_I2C_ClearFlag_BERR(I2C1);
    reset_bus(twi);
    handled_any = true;
  }
  if (LL_I2C_IsActiveFlag_ARLO(I2C1)) {
    // Arbitration lost, meaning we couldn't acquire the bus.
    LL_I2C_ClearFlag_ARLO(I2C1);
    handled_any = true;
#ifdef RULOS_I2C_V2
    // Pure ARLO on V2 (not accompanied by ADDR -- the ADDR+ARLO case
    // is handled by I2C1_EV_IRQHandler before ER can run). We lost to
    // a master that isn't addressing us, so no slave-receive STOP
    // will kick us when the bus clears. Schedule a poll task to
    // re-launch the send once BUSY drops.
    if (MASTER_ACTIVE(twi) && !twi->send_retry_pending) {
      twi->send_retry_pending = true;
      twi->send_arlo_retries++;
      schedule_us(1000, twi_arlo_retry_poll, twi);
    }
#endif
  }
#ifdef RULOS_I2C_V1
  if (LL_I2C_IsActiveFlag_AF(I2C1)) {
    // Destination address didn't ack when we sent their address.
    LL_I2C_ClearFlag_AF(I2C1);
    handled_any = true;
  }
#endif
  if (LL_I2C_IsActiveFlag_OVR(I2C1)) {
    LL_I2C_ClearFlag_OVR(I2C1);
    handled_any = true;
  }

  // If no error flag was set we were tail-chained into with nothing to
  // do -- most likely because I2C1_EV_IRQHandler already cleared an
  // ARLO inline as part of the ADDR-while-master multimaster race
  // handling. Dispatching to twi_recv_error_interrupt in that case
  // would disable the RX DMA request that the EV handler just set up.
  if (!handled_any) {
    return;
  }

  // If a V2 retry is pending, skip the send_error_interrupt path --
  // it would null send_done_cb and upcall the user, dropping the
  // packet we're trying to transparently retry.
  if (MASTER_ACTIVE(twi)
#ifdef RULOS_I2C_V2
      && !twi->send_retry_pending
#endif
  ) {
    twi_send_error_interrupt(twi);
  } else {
    twi_recv_error_interrupt(twi);
  }
}
